[
	{
		"title": "Pirate Troubles",
		"description": "A story of two pirates that revolves around matching their actions to the provided soundclip.  The animation was done in Maya, and we were given these characters, which were rigged by the Eleven-Rig, to animate.",
		"urls": {
			"image": "pirates.png",
			"thumbnail": "pirates-thumb.png",
			"video": "https://www.youtube.com/watch?v=SDAsH6WmZBM",
			"code": "",
			"link": ""
		}
	},

	{
		"title": "The Lift",
		"description": "A man tries to lift a very heavy box, and struggles in the process.  Specifically, in Maya, I animated this man walking over to an object, thinking about picking it up, actually picking it up, and then walking offscreen with it.",
		"urls": {
			"image": "box-guy.png",
			"thumbnail": "box-guy-thumb.png",
			"video": "https://www.youtube.com/watch?v=SVHNXw78lVE",
			"code": "",
			"link": ""
		}
	},

	{
		"title": "Henry Says Hi",
		"description": "An animation created in Blender in which I create my first character model and character rig, as well as explore concepts such as weight painting, vertex groups, constrants, the NLA editor, the Video Sequencer, the Action Editor, shape keys, lip synching, and poses.",
		"urls": {
			"image": "henry.png",
			"thumbnail": "henry-thumb.png",
			"video": "https://www.youtube.com/watch?v=mNupRvxjJrs",
			"code": "",
			"link": ""
		}
	},

	{
		"title": "Chalk Talk Animation",
		"description": "A boy plays catch with a chalk drawing, and soon discovers that the chalkboard is an alternate dimension!  The soundtrack in the background is audio taken from iMovie sound clips.\n\n Partners: Alexa Azarian & Feng Shen",
		"urls": {
			"image": "chalktalk.png",
			"thumbnail": "chalktalk-thumb.png",
			"video": "https://www.youtube.com/watch?v=qa3wESto2tM",
			"code": "",
			"link": ""
		}
	},

	{
		"title": "Claymation",
		"description": "An assortment of colored clay shapes dance to the tune of the 'Gravity Falls' theme song.  This took a number of hours to create, even though the actual video looks simple enough! \n\n Partners: Alexa Azarian & Feng Shen",
		"urls": {
			"image": "claymation.png",
			"thumbnail": "claymation-thumb.png",
			"video": "https://www.youtube.com/watch?v=6ia9xy09yy0",
			"code": "",
			"link": ""
		}
	},

	{
		"title": "Lyric Animation",
		"description": "A lyric video in which I time the sonics of the song, 'Welcome to the Working Week', by Elvis Costello, to the the written lyrics in After Effects.",
		"urls": {
			"image": "working-week.png",
			"thumbnail": "working-week-thumb.png",
			"video": "https://www.youtube.com/watch?v=a0ZUsxdX_-4",
			"code": "",
			"link": ""
		}
	},

	{
		"title": "Lighthouse Scene",
		"description": "A short clip of a light rotating around a lighthouse on the shore on a foggy night.  This animation was created in Blender in my junior year of high school, so that was a while ago.",
		"urls": {
			"image": "lighthouse.png",
			"thumbnail": "lighthouse-thumb.png",
			"video": "https://www.youtube.com/watch?v=cLyVd0Vtmss",
			"code": "",
			"link": ""
		}
	},

	{
		"title": "Crystal Planet",
		"description": "A barren planet that only harbors green crystals and fireflies.  It could perhaps be the setting of a story where an alien species inhabits an undiscovered planet.  This scene created in Blender back when I was still in high school.",
		"urls": {
			"image": "crystals.png",
			"thumbnail": "crystals-thumb.png",
			"video": "",
			"code": "",
			"link": ""
		}
	},

	{
		"title": "Jungle Campfire",
		"description": "A campfire at night within a tame jungle.  This image demonstrates knowledge of smoke simulations, particle systems, and node-compositing.  It was created in Blender during my senior year of high school.",
		"urls": {
			"image": "fire.png",
			"thumbnail": "fire-thumb.png",
			"video": "",
			"code": "",
			"link": ""
		}
	},

	{
		"title": "Chanukkah Season",
		"description": "A room filled to the brim with Chanukkah presents and winter decorations!  Menorah candles are always so awesome to see lit up!  This image was created in Blender in my junior year of high school.",
		"urls": {
			"image": "chanukkah.png",
			"thumbnail": "chanukkah-thumb.png",
			"video": "",
			"code": "",
			"link": ""
		}
	},

	{
		"title": "Feeding the Flower",
		"description": "An invisible hand pours water into a potted plant's soil. Isn't magic fantastic!? This was an investigation of fluid simulations in Blender.",
		"urls": {
			"image": "flower.png",
			"thumbnail": "flower-thumb.png",
			"video": "",
			"code": "",
			"link": ""
		}
	}
]