[
	{
		"title": "Number Printer",
		"description": "This app combines the knowledge I gathered from my co-op at Cengage Learning about web apps. It converts a given input value (integer or decimal) into English words. Maven and Tomcat are used to build and locally host the app, while Google App Engine hosts the app live at a domain. A Java servlet attempts to validate all input before the number conversion takes place, and notifies a user if the input does not meet the criteria for conversion.",
		"urls": {
			"image": "/img/apps/number-printer.png",
			"thumbnail": "/img/apps/number-printer-thumb.png",
			"video": "",
			"github": "https://github.com/joberstein/Number-Printer",
			"interactive": "http://number-printer.appspot.com/"
		}
	},
	
	{
		"title": "Eliza's Numbers",
		"description": "This android app is a guessing game, where a user has 12 guesses to determine a mystery number between 1 and 1000. The program will inform the user if a guess is higher or lower than the target number, keep a list of past guess for the current game, and save a user's lowest number of guesses.",
		"urls": {
			"image": "/img/apps/elizas-numbers.jpg",
			"thumbnail": "/img/apps/elizas-numbers-thumb.jpg",
			"video": "",
			"github": "https://github.com/joberstein/Elizas-Numbers",
			"interactive": ""
		}
	},
	
	{
		"title": "MP3 Player",
		"description": "This MP3 player is completely customizable with XML!  Some features of this player are: it displays extended song information for a song that is clicked on, a user can sort songs by four different categories, pause/rewind/next song controls are implemented, current time progress for each song is tracked, and there is a page system. Since it takes such a long time to download from Github, I'm working on featuring it somewhere on this website.",
		"urls": {
			"image": "/img/apps/mp3-player.png",
			"thumbnail": "/img/apps/mp3-player-thumb.png",
			"video": "",
			"github": "https://github.com/joberstein/MP3-Player",
			"interactive": ""
		}
	}
]