[
	{
		"title": "Spongebob Trivia",
		"description": "Test how much you really know about the popular Nickelodeon show, Spongebob Squarepants.  This project focused on extracting information from an XML document and determining whether user input satisfied a condition or not.",
		"urls": {
			"image": "spongebob.png",
			"thumbnail": "spongebob-thumb.png",
			"video": "",
			"code": "https://github.com/joberstein/Spongebob-Trivia",
			"link": ""
		}
	},
	
	{
		"title": "Fairy Tail Magic Quiz",
		"description": "Take this quiz to discover the type of Fairy Tail (an anime) magic you would wield if you were a character in that universe.  It was created with information extracted from an XML document, and focuses on the concept of dynamic navigation.",
		"urls": {
			"image": "fairy-tail.png",
			"thumbnail": "fairy-tail-thumb.png",
			"video": "",
			"code": "https://github.com/joberstein/Fairy-Tail-Magic-Quiz",
			"link": ""
		}
	},
	
	{
		"title": "Click n' Create",
		"description": "Take a breather and have some fun with this simple clicking game!  Click around and then close shapes you create so that they can be filled with a randomly chosen color each time. This game focuses on interpreting user input, as well as dynamically creating PShapes in Processing.",
		"urls": {
			"image": "click-n-create.png",
			"thumbnail": "click-n-create-thumb.png",
			"video": "",
			"code": "https://github.com/joberstein/Click-n-Create-Shapes",
			"link": ""
		}
	},
	
	{
		"title": "Twerking Robot",
		"description": "Ever wanted to see R.O.B. from Super Smash Bros. Brawl twerk?  Well, now you can!  Using the mouse, move R.O.B. around Battlefield and watch him twerk. He may also light bushes on fire... what a character!",
		"urls": {
			"image": "twerking-robot.png",
			"thumbnail": "twerking-robot-thumb.png",
			"video": "",
			"code": "https://github.com/joberstein/Twerking-Robot",
			"link": ""
		}
	},
	
	{
		"title": "Frogger",
		"description": "I designed this game in my Fundamentals of Computer Science 2 class.  My partner and I worked on this project for a two week span and took turns coding, finding and resizing the images we used appropriately, and writing material for an audience to read so that any person will be able to play our game.\n\nPartner: Sam Davies",
		"urls": {
			"image": "frogger.png",
			"thumbnail": "frogger-thumb.png",
			"video": "https://www.youtube.com/embed/YXut60Z_oP8",
			"code": "",
			"link": ""
		}
	}
]